In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [2]:
animals=DataFrame(np.arange(16).reshape(4,4),
                 columns=['w','x','y','z'],
                 index=['dog','cat','bird','mouse'])
animals

        w   x   y   z
dog     0   1   2   3
cat     4   5   6   7
bird    8   9  10  11
mouse  12  13  14  15

In [3]:
animals.ix[1:3,['w','y']]=np.nan
animals

        w   x   y   z
dog     0   1   2   3
cat   NaN   5 NaN   7
bird  NaN   9 NaN  11
mouse  12  13  14  15

In [4]:
behave_map={'w':'good','x':'bad','y':'good','z':'bad'}

In [5]:
animal_col=animals.groupby(behave_map, axis=1)
animal_col.sum()

       bad  good
dog      4     2
cat     12   NaN
bird    20   NaN
mouse   28    26

In [6]:
behav_ser=Series(behave_map)
behav_ser

w    good
x     bad
y    good
z     bad
dtype: object

In [7]:
animals.groupby(behav_ser,axis=1).count()

       bad  good
dog      2     2
cat      2     0
bird     2     0
mouse    2     2

In [8]:
animals

        w   x   y   z
dog     0   1   2   3
cat   NaN   5 NaN   7
bird  NaN   9 NaN  11
mouse  12  13  14  15

In [9]:
animals.groupby(len).sum()

    w   x   y   z
3   0   6   2  10
4 NaN   9 NaN  11
5  12  13  14  15

In [10]:
keys=['a','b','a','b']

In [11]:
animals.groupby([len,keys]).max()

      w   x   y   z
3 a   0   1   2   3
  b NaN   5 NaN   7
4 a NaN   9 NaN  11
5 b  12  13  14  15

In [12]:
heir_col=pd.MultiIndex.from_arrays([['ny','ny','ny','sf','sf'],
                                   [1,2,3,1,3]],
                                   names=['cities','sub_values'])

In [13]:
df_hr=DataFrame(np.arange(25).reshape(5,5), columns=heir_col)

In [14]:
df_hr = df_hr*100

In [15]:
df_hr

cities        ny                sf
sub_values     1     2     3     1     3
0              0   100   200   300   400
1            500   600   700   800   900
2           1000  1100  1200  1300  1400
3           1500  1600  1700  1800  1900
4           2000  2100  2200  2300  2400